#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ayur/snowflake-demo/runs/run-n6r2aJ5sfBjjrRrZ

Waiting for the plan to start...

Terraform v1.9.8
on linux_amd64
Initializing plugins and modules...
snowflake_database.dev_db: Refreshing state... [id=DEV_DB]
snowflake_role.dev_role: Refreshing state... [id=DEV_ROLE]
snowflake_grant_account_role.grants: Refreshing state... [id="DEV_ROLE"|USER|"VISEO"]
snowflake_grant_privileges_to_account_role.database_grant: Refreshing state... [id="DEV_ROLE"|false|false|USAGE|OnAccountObject|DATABASE|"DEV_DB"]
snowflake_schema.staging: Refreshing state... [id="DEV_DB"."STAGING"]
snowflake_grant_privileges_to_account_role.schema_grant: Refreshing state... [id="DEV_ROLE"|false|false|USAGE|OnSchema|OnSchema|"DEV_DB"."STAGING"]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # snowflake_grant_privileges_to_account_role.schema_grant1 will be created
  + resource "snowflake_grant_privileges_to_account_role" "schema_grant1" {
      + account_role_name = "DEV_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "USAGE",
        ]
      + with_grant_option = false

      + on_schema {
          + schema_name = "\"DEV_DB\".\"RAW_DTV\""
        }
    }

  # snowflake_grant_privileges_to_account_role.schema_grant2 will be created
  + resource "snowflake_grant_privileges_to_account_role" "schema_grant2" {
      + account_role_name = "DEV_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "USAGE",
        ]
      + with_grant_option = false

      + on_schema {
          + schema_name = "\"DEV_DB\".\"BUSINESS_DTV\""
        }
    }

  # snowflake_grant_privileges_to_account_role.schema_grant3 will be created
  + resource "snowflake_grant_privileges_to_account_role" "schema_grant3" {
      + account_role_name = "DEV_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "USAGE",
        ]
      + with_grant_option = false

      + on_schema {
          + schema_name = "\"DEV_DB\".\"INFO_DELIVERY\""
        }
    }

  # snowflake_grant_privileges_to_account_role.tables_grant will be created
  + resource "snowflake_grant_privileges_to_account_role" "tables_grant" {
      + account_role_name = "DEV_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "INSERT",
          + "SELECT",
        ]
      + with_grant_option = false

      + on_schema_object {
          + future {
              + in_database        = "DEV_DB"
              + object_type_plural = "TABLES"
            }
        }
    }

  # snowflake_schema.business_dtv will be created
  + resource "snowflake_schema" "business_dtv" {
      + catalog                                       = (known after apply)
      + data_retention_time_in_days                   = (known after apply)
      + database                                      = "DEV_DB"
      + default_ddl_collation                         = (known after apply)
      + describe_output                               = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + id                                            = (known after apply)
      + is_transient                                  = "default"
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "BUSINESS_DTV"
      + parameters                                    = (known after apply)
      + pipe_execution_paused                         = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + show_output                                   = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
      + with_managed_access                           = "false"
    }

  # snowflake_schema.info_delivery will be created
  + resource "snowflake_schema" "info_delivery" {
      + catalog                                       = (known after apply)
      + data_retention_time_in_days                   = (known after apply)
      + database                                      = "DEV_DB"
      + default_ddl_collation                         = (known after apply)
      + describe_output                               = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + id                                            = (known after apply)
      + is_transient                                  = "default"
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "INFO_DELIVERY"
      + parameters                                    = (known after apply)
      + pipe_execution_paused                         = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + show_output                                   = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
      + with_managed_access                           = "false"
    }

  # snowflake_schema.raw_dtv will be created
  + resource "snowflake_schema" "raw_dtv" {
      + catalog                                       = (known after apply)
      + data_retention_time_in_days                   = (known after apply)
      + database                                      = "DEV_DB"
      + default_ddl_collation                         = (known after apply)
      + describe_output                               = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + id                                            = (known after apply)
      + is_transient                                  = "default"
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "RAW_DTV"
      + parameters                                    = (known after apply)
      + pipe_execution_paused                         = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + show_output                                   = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
      + with_managed_access                           = "false"
    }

  # snowflake_warehouse.warehouse will be created
  + resource "snowflake_warehouse" "warehouse" {
      + auto_resume                         = "default"
      + auto_suspend                        = 60
      + enable_query_acceleration           = "default"
      + fully_qualified_name                = (known after apply)
      + id                                  = (known after apply)
      + max_concurrency_level               = (known after apply)
      + name                                = "DEV_WH"
      + parameters                          = (known after apply)
      + query_acceleration_max_scale_factor = -1
      + show_output                         = (known after apply)
      + statement_queued_timeout_in_seconds = (known after apply)
      + statement_timeout_in_seconds        = (known after apply)
      + warehouse_size                      = "xsmall"
    }

Plan: 8 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "SNOWFLAKE_REGION" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-n6r2aJ5sfBjjrRrZ/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "SNOWFLAKE_PASSWORD" but
│ a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-n6r2aJ5sfBjjrRrZ/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 2 other variable(s)
│ defined without being declared.
╵
╷
│ Warning: Argument is deprecated
│ 
│   with provider["registry.terraform.io/snowflake-labs/snowflake"],
│   on main.tf line 18, in provider "snowflake":
│   18: provider "snowflake" {
│ 
│ Specify the region as part of the account parameter
│ 
│ (and 4 more similar warnings elsewhere)
╵
╷
│ Warning: Deprecated Resource
│ 
│   with snowflake_role.dev_role,
│   on roles.tf line 1, in resource "snowflake_role" "dev_role":
│    1: resource "snowflake_role" "dev_role" {
│ 
│ This resource is deprecated and will be removed in a future major version
│ release. Please use snowflake_account_role instead.
│ 
│ (and one more similar warning elsewhere)
╵

```

</details>

*Pusher: @yassinedehbi, Action: `pull_request`, Working Directory: ``, Workflow: `Snowflake Terraform Workflow`*